<h3>Задание 1</h3>

<?php
// #1 ----------------------------------------------------------------------------------------------------------

$i = 0;
while ($i <= 100 ) {
    if($i % 3 == 0) {
        echo "$i ";
    }
    $i++;
}

?>

<h3>Задание 2</h3>

<?php
// #2 ----------------------------------------------------------------------------------------------------------

$i = 0;
do {
    if($i == 0) {
        echo "$i - ноль<br>";
    } elseif ($i % 2 == 0) {
        echo "$i - четное число<br>";
    } else {
        echo "$i - нечтное число<br>";
    }
} while ($i++ < 10);

?>

<h3>Задание 3</h3>

<?php
// #3 ----------------------------------------------------------------------------------------------------------

$array = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Касимов', 'Скопин']
];

foreach($array as $area_name => $cities) {
    echo "<br>$area_name: " . implode(", ", $cities);
}

?>

<h3>Задание 4</h3>

<?php
// #4 ----------------------------------------------------------------------------------------------------------

function transliteration($txt) {
    $letters = [
        "а" => "a", 
		"б" => "b", 
		"в" => "v", 
		"г" => "g", 
		"д" => "d", 
		"е" => "e", 
		"ё" => "yo",
		"ж" => "zh", 
		"з" => "z", 
		"и" => "i", 
		"й" => "y", 
		"к" => "k", 
		"л" => "l", 
		"м" => "m",
		"н" => "n", 
		"о" => "o", 
		"п" => "p", 
		"р" => "r", 
		"с" => "s", 
		"т" => "t", 
		"у" => "u",
		"ф" => "f", 
		"х" => "h", 
		"ц" => "ts", 
		"ч" => "ch", 
		"ш" => "sh", 
		"щ" => "s'h", 
		"ъ" => "",
		"ы" => "i", 
		"ь" => "'", 
		"э" => "e", 
		"ю" => "yu", 
		"я" => "ya",
    ];
    return strtr($txt, $letters);
};

$txt = "привет! сегодня хороший день!";
echo "$txt => " . transliteration($txt);

?>

<h3>Задание 5</h3>

<?php
// #5 ----------------------------------------------------------------------------------------------------------

function space($txt) {
    $space = [
        " " => "_",
    ];
    return strtr($txt, $space);
}

echo "$txt => " . space($txt);

?>

<h3>Задание 7</h3>

<?php
// #7 ----------------------------------------------------------------------------------------------------------

for($i = 0; $i < 10; print $i++ . " ");

?>

<h3>Задание 8</h3>

<?php
// #8 ----------------------------------------------------------------------------------------------------------

foreach($array as $area_name => $cities) {
    echo "<br>$area_name: ";
    foreach ($cities as $city) {
        $cityName = "";
        if(mb_substr($city, 0, 1) === "К") {
            $cityName .= $city;
        };
        echo "$cityName ";
    };
}

?>

<h3>Задание 9</h3>

<?php
// #9 ----------------------------------------------------------------------------------------------------------

function replace($txt) {
    $txt = transliteration($txt);
    return space($txt);
}

echo "$txt => " . replace($txt);